content/hybrid-recursion/hybrid-recursion.org
#+TITLE:           Hybrid Recursion Scheme for the Reader and CST Libraries
#+AUTHOR:          Jan Moringen

#+OPTIONS:         toc:nil num:nil
#+HTML_HEAD_EXTRA: <style>body { width:60%; margin:40px auto; margin-left: 20%; padding:0 10px; text-align:justify; line-height:1.4; font-size:16px; color:#444; } h1,h2,h3 { line-height:1.2 }</style>
#+MACRO:           color @@html:<font color="$1">$2</font>@@
#+MACRO:           cl src_lisp[:exports code]{$1}

* Problem Statement

  I'm going through the read/cst/ast libraries and removing
  limitations caused by recursively implemented algorithms. Examples
  are

  + Eclector
    + ~fixup~
  + Concrete syntax tree
    + ~cst-from-expression~
    + ~reconstruct~ (and its helper functions)

  A simple illustration of the issue is this function from the
  ~concrete-syntax-tree~ library

  #+begin_src lisp -n
    (defun cons-table (cst &optional (table (make-hash-table :test #'eq)))
      (labels ((traverse (cst)
                 (let ((raw (raw cst)))
                   (when (and (consp cst) (cl:null (gethash raw table)))
                     (setf (gethash raw table) cst)
                     (traverse (first cst))
                     (traverse (rest cst))))))
        (traverse cst))
      table)
  #+end_src

  In bad cases, the stack space required is proportional to the input
  size (In the common case of a long proper list, we may get saved by
  the fact that tail call optimization can make the second recursive
  call not consume stack space but for a general tree structure the
  statement holds).

  # :exports both :results output
  #+begin_src lisp
    (handler-case
        (cst::cons-table (cst:cst-from-expression (make-list 100000)))
      (storage-condition (condition)
        (princ condition)))
  #+end_src

  # #+RESULTS:
  #+begin_example
    Control stack guard page temporarily disabled: proceed with caution
    Control stack exhausted (no more space for function call frames).
    This is probably due to heavily nested or infinitely recursive function
    calls, or a tail call that SBCL cannot or has not optimized away.

    PROCEED WITH CAUTION.
  #+end_example

* Approach

  To remove the limitations, we could use an iterative implementation
  with a worklist:

  #+begin_src lisp -n
    (defun cons-table (cst &optional (table (make-hash-table :test #'eq)))
      (loop with worklist = (make-array 1 :adjustable t
                                          :fill-pointer 1
                                          :initial-contents (cl:list cst))
            for cst = (vector-pop worklist)
            do (let ((raw (raw cst)))
                 (when (and (consp cst) (cl:null (gethash raw table)))
                   (setf (gethash raw table) cst)
                   (vector-push-extend (first cst) worklist)
                   (vector-push-extend (rest cst) worklist)))
            when (zerop (length worklist))
              do (return table)))
  #+end_src

  However, this iterative approach comes with a lot of overhead,
  especially for small trees that would be completely fine within the
  limited stack space:

  + Allocation and initialization of the {{{cl(worklist)}}} array.

  + Pushing and popping worklist items

  + Termination check

** Simple Case

   As a compromise, I came up with the following (I suspect this pattern
   to be well-known and maybe it even has a name but I can't think of
   anything):

   #+begin_src lisp -n
     (defun cons-table (cst &optional (table (make-hash-table :test #'eq)))
       (let ((tail (cl:list cst)))
         (declare (dynamic-extent tail))
         (flet ((enqueue (element)
                  (let ((cell (cl:cons element nil)))
                    (setf (cdr tail) cell
                          tail cell))))
           (declare (dynamic-extent (function enqueue)))
           (labels ((traverse (cst depth)
                      (if (< depth 1000)
                          (let (raw)
                            (when (and (consp cst)
                                       (cl:null
                                        (gethash (setf raw (raw cst)) table)))
                              (setf (gethash raw table) cst)
                              (let ((depth+1 (1+ depth)))
                                (traverse (first cst) depth+1)
                                ;; This second call could use just DEPTH if
                                ;; we could be sure about tail call
                                ;; optimization.
                                (traverse (rest cst) depth+1))))
                          (enqueue cst))))
             (loop for worklist = tail then (cl:rest worklist)
                   for cst = (cl:first worklist)
                   do (traverse cst 0)
                   when (cl:null (cl:rest worklist))
                     do (loop-finish)))))
       table)
   #+end_src

   This implementation is optimized for the common case of small inputs
   that would work fine with just the recursive implementation:

   + The "inner loop", that is recursive ~traverse~ calls, is almost
     unchanged. The only changes are the ~depth~ parameter and the
     {{{cl((< depth 1000))}}} check.

   + The initial element of the worklist is allocated without consing
     and the worklist code leaves the loop after a single iteration.

   + {{{cl(enqueue)}}} is called only on the slow path so the fact
     that it conses and is not inlined should not matter.

