content/hybrid-recursion/hybrid-recursion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-18 Fri 16:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hybrid Recursion Scheme for the Reader and CST Libraries</title>
<meta name="author" content="Jan Moringen" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Hybrid Recursion Scheme for the Reader and CST Libraries</h1>
<div id="outline-container-org93bdc08" class="outline-2">
<h2 id="org93bdc08">Problem Statement</h2>
<div class="outline-text-2" id="text-org93bdc08">
<p>
I'm going through the read/cst/ast libraries and removing
limitations caused by recursively implemented algorithms. Examples
are
</p>

<ul class="org-ul">
<li>Eclector
<ul class="org-ul">
<li><code>fixup</code></li>
</ul></li>
<li>Concrete syntax tree
<ul class="org-ul">
<li><code>cst-from-expression</code></li>
<li><code>reconstruct</code> (and its helper functions)</li>
</ul></li>
</ul>

<p>
A simple illustration of the issue is this function from the
<code>concrete-syntax-tree</code> library
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="linenr">1: </span>(<span style="color: #6c9ef8;">defun</span> <span style="color: #b77fdb; font-weight: bold;">cons-table</span> (cst <span style="color: #00aa80;">&amp;optional</span> (table (make-hash-table <span style="color: #b77fdb;">:test</span> #'eq)))
<span class="linenr">2: </span>  (<span style="color: #6c9ef8;">labels</span> ((traverse (cst)
<span class="linenr">3: </span>             (<span style="color: #6c9ef8;">let</span> ((raw (raw cst)))
<span class="linenr">4: </span>               (<span style="color: #6c9ef8;">when</span> (and (consp cst) (cl:null (gethash raw table)))
<span class="linenr">5: </span>                 (setf (gethash raw table) cst)
<span class="linenr">6: </span>                 (traverse (first cst))
<span class="linenr">7: </span>                 (traverse (rest cst))))))
<span class="linenr">8: </span>    (traverse cst))
<span class="linenr">9: </span>  table)
</pre>
</div>

<p>
In bad cases, the stack space required is proportional to the input
size (In the common case of a long proper list, we may get saved by
the fact that tail call optimization can make the second recursive
call not consume stack space but for a general tree structure the
statement holds).
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span style="color: #6c9ef8;">handler-case</span>
    (cst::cons-table (cst:cst-from-expression (make-list 100000)))
  (storage-condition (condition)
    (princ condition)))
</pre>
</div>

<pre class="example" id="org02afdbb">
Control stack guard page temporarily disabled: proceed with caution
Control stack exhausted (no more space for function call frames).
This is probably due to heavily nested or infinitely recursive function
calls, or a tail call that SBCL cannot or has not optimized away.

PROCEED WITH CAUTION.
</pre>
</div>
</div>
<div id="outline-container-orgd36b3f1" class="outline-2">
<h2 id="orgd36b3f1">Approach</h2>
<div class="outline-text-2" id="text-orgd36b3f1">
<p>
To remove the limitations, we could use an iterative implementation
with a worklist:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="linenr"> 1: </span>(<span style="color: #6c9ef8;">defun</span> <span style="color: #b77fdb; font-weight: bold;">cons-table</span> (cst <span style="color: #00aa80;">&amp;optional</span> (table (make-hash-table <span style="color: #b77fdb;">:test</span> #'eq)))
<span class="linenr"> 2: </span>  (<span style="color: #6c9ef8;">loop</span> with worklist = (make-array 1 <span style="color: #b77fdb;">:adjustable</span> t
<span class="linenr"> 3: </span>                                      <span style="color: #b77fdb;">:fill-pointer</span> 1
<span class="linenr"> 4: </span>                                      <span style="color: #b77fdb;">:initial-contents</span> (cl:list cst))
<span class="linenr"> 5: </span>        for cst = (vector-pop worklist)
<span class="linenr"> 6: </span>        do (<span style="color: #6c9ef8;">let</span> ((raw (raw cst)))
<span class="linenr"> 7: </span>             (<span style="color: #6c9ef8;">when</span> (and (consp cst) (cl:null (gethash raw table)))
<span class="linenr"> 8: </span>               (setf (gethash raw table) cst)
<span class="linenr"> 9: </span>               (vector-push-extend (first cst) worklist)
<span class="linenr">10: </span>               (vector-push-extend (rest cst) worklist)))
<span class="linenr">11: </span>        when (zerop (length worklist))
<span class="linenr">12: </span>          do (<span style="color: #6c9ef8;">return</span> table)))
</pre>
</div>

<p>
However, this iterative approach comes with a lot of overhead,
especially for small trees that would be completely fine within the
limited stack space:
</p>

<ul class="org-ul">
<li>Allocation and initialization of the <code class="src src-lisp">worklist</code> array.</li>

<li>Pushing and popping worklist items</li>

<li>Termination check</li>
</ul>
</div>
<div id="outline-container-org4a16ed0" class="outline-3">
<h3 id="org4a16ed0">Simple Case</h3>
<div class="outline-text-3" id="text-org4a16ed0">
<p>
As a compromise, I came up with the following (I suspect this pattern
to be well-known and maybe it even has a name but I can't think of
anything):
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="linenr"> 1: </span>(<span style="color: #6c9ef8;">defun</span> <span style="color: #b77fdb; font-weight: bold;">cons-table</span> (cst <span style="color: #00aa80;">&amp;optional</span> (table (make-hash-table <span style="color: #b77fdb;">:test</span> #'eq)))
<span class="linenr"> 2: </span>  (<span style="color: #6c9ef8;">let</span> ((tail (cl:list cst)))
<span class="linenr"> 3: </span>    (<span style="color: #6c9ef8;">declare</span> (dynamic-extent tail))
<span class="linenr"> 4: </span>    (<span style="color: #6c9ef8;">flet</span> ((enqueue (element)
<span class="linenr"> 5: </span>             (<span style="color: #6c9ef8;">let</span> ((cell (cl:cons element nil)))
<span class="linenr"> 6: </span>               (setf (cdr tail) cell
<span class="linenr"> 7: </span>                     tail cell))))
<span class="linenr"> 8: </span>      (<span style="color: #6c9ef8;">declare</span> (dynamic-extent (function enqueue)))
<span class="linenr"> 9: </span>      (<span style="color: #6c9ef8;">labels</span> ((traverse (cst depth)
<span class="linenr">10: </span>                 (<span style="color: #6c9ef8;">if</span> (&lt; depth 1000)
<span class="linenr">11: </span>                     (<span style="color: #6c9ef8;">let</span> (raw)
<span class="linenr">12: </span>                       (<span style="color: #6c9ef8;">when</span> (and (consp cst)
<span class="linenr">13: </span>                                  (cl:null
<span class="linenr">14: </span>                                   (gethash (setf raw (raw cst)) table)))
<span class="linenr">15: </span>                         (setf (gethash raw table) cst)
<span class="linenr">16: </span>                         (<span style="color: #6c9ef8;">let</span> ((depth+1 (1+ depth)))
<span class="linenr">17: </span>                           (traverse (first cst) depth+1)
<span class="linenr">18: </span>                           <span style="color: #808080; font-style: italic;">;; </span><span style="color: #808080; font-style: italic;">This second call could use just DEPTH if</span>
<span class="linenr">19: </span>                           <span style="color: #808080; font-style: italic;">;; </span><span style="color: #808080; font-style: italic;">we could be sure about tail call</span>
<span class="linenr">20: </span>                           <span style="color: #808080; font-style: italic;">;; </span><span style="color: #808080; font-style: italic;">optimization.</span>
<span class="linenr">21: </span>                           (traverse (rest cst) depth+1))))
<span class="linenr">22: </span>                     (enqueue cst))))
<span class="linenr">23: </span>        (<span style="color: #6c9ef8;">loop</span> for worklist = tail then (cl:rest worklist)
<span class="linenr">24: </span>              for cst = (cl:first worklist)
<span class="linenr">25: </span>              do (traverse cst 0)
<span class="linenr">26: </span>              when (cl:null (cl:rest worklist))
<span class="linenr">27: </span>                do (loop-finish)))))
<span class="linenr">28: </span>  table)
</pre>
</div>

<p>
This implementation is optimized for the common case of small inputs
that would work fine with just the recursive implementation:
</p>

<ul class="org-ul">
<li>The "inner loop", that is recursive <code>traverse</code> calls, is almost
unchanged. The only changes are the <code>depth</code> parameter and the
<code class="src src-lisp">(&lt; depth 1000)</code> check.</li>

<li>The initial element of the worklist is allocated without consing
and the worklist code leaves the loop after a single iteration.</li>

<li><code class="src src-lisp">enqueue</code> is called only on the slow path so the fact
that it conses and is not inlined should not matter.</li>
</ul>
</div>
</div>
