content/hybrid-recursion/hybrid-recursion.org
* Limitations

  Whenever we pop a work item from the worklist and "restart" the
  recursion, the {{{cl(traverse)}}} call at depth 0 starts with a
  dynamic environment that comes from the enclosing function. This is
  different from the naive recursive implementation in which the
  dynamic environment would come from enclosing {{{cl(traverse)}}}
  calls which would correspond to the structure of the input.

  This limitation could matter if the recursive processing was
  intertwined with calling functions controlled by the client. An
  example of such a structure is the generic function {{{cl(fixup)}}}
  in Eclector. A client could define methods that establish and read
  dynamic variable bindings. Those bindings would get undone whenever
  we restart the recursion.

  Unfortunately this problem could easily go unnoticed since only
  deeply nested inputs reveal the incorrect assumption.

# Local Variables:
# eval: (slime-disable-contrib 'slime-highlight-edits)
# End:
