content/hybrid-recursion/hybrid-recursion.html
<div id="outline-container-org7aec95b" class="outline-2">
<h2 id="org7aec95b">Limitations</h2>
<div class="outline-text-2" id="text-org7aec95b">
<p>
Whenever we pop a work item from the worklist and "restart" the
recursion, the <code class="src src-lisp">traverse</code> call at depth 0 starts with a
dynamic environment that comes from the enclosing function. This is
different from the naive recursive implementation in which the
dynamic environment would come from enclosing <code class="src src-lisp">traverse</code>
calls which would correspond to the structure of the input.
</p>

<p>
This limitation could matter if the recursive processing was
intertwined with calling functions controlled by the client. An
example of such a structure is the generic function <code class="src src-lisp">fixup</code>
in Eclector. A client could define methods that establish and read
dynamic variable bindings. Those bindings would get undone whenever
we restart the recursion.
</p>

<p>
Unfortunately this problem could easily go unnoticed since only
deeply nested inputs reveal the incorrect assumption.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jan Moringen</p>
<p class="date">Created: 2025-04-18 Fri 16:31</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
